CSI API ETABS v1
cLoadPatterns.Delete Method
 Deletes the specified load pattern.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Delete(
	string Name
)
Function Delete (
	Name As String
) As Integer
Dim instance As cLoadPatterns
Dim Name As String
Dim returnValue As Integer
returnValue = instance.Delete(Name)
int Delete(
	String^ Name
)
abstract Delete :
        Name : string -> int
Parameters
Name
Type: System.String
 The name of an existing load pattern.
Return Value
Type: Int32
 Returns zero if the load pattern is successfully deleted, otherwise it returns a nonzero value.
Remarks
 The load pattern is not deleted and the function returns an error if the load pattern is assigned to an load case or if it is the only defined load pattern.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'delete load case
       ret = SapModel.LoadPatterns.Delete("DEAD")
   'Note:  ret in the above line returns 1, indicating an error.
   'This is because the load pattern DEAD is assigned to
   'load case DEAD.
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLoadPatterns Interface
ETABSv1 Namespace